Autodesk.Revit.DB.IExportContext.OnDaylightPortal(Autodesk.Revit.DB.DaylightPortalNode)
This method marks the beginning of export of a daylight portal.
node:
A node describing the daylight portal object.
Since:
2014

Autodesk.Revit.DB.IExportContext.OnFaceBegin(Autodesk.Revit.DB.FaceNode)
This method marks the beginning of a Face to be exported
Remarks:
Note that OnFaceBeging (as well as OnFaceEnd) is called only if
the custom exporter was set up to include faces in the output stream.
See CustomExporter.IncudeFaces for mode details.
node:
An output node that represents a Face.
Returns:
Return RenderNodeAction.Proceed if you wish to receive geometry (polymesh)
for this face, or return RenderNodeAction.Skip otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContext.IsCanceled
This method is queried at the begining of every element.
Returns:
Return True if you wish to cancel the exporting process, or False otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContext.Finish
This method is called at the very end of the export proces,
after all entities were processed (or after the process was cancelled).
Since:
2014

Autodesk.Revit.DB.IExportContext.Start
This method is called at the very start of the export proces,
still before the first entity of the model was send out.
Returns:
Return True if you are ready to proceed with processing the export.
Since:
2014

Autodesk.Revit.DB.IExportContext
An interface that is used in custom export to process a Revit model.
An instance of this class is passed in as a parameter of a CustomExporter.
The methods herein are then called at times of exporting entities of the model.
Since:
2014